---
kind: method
id: M:Autodesk.Revit.DB.BRepBuilderSurfaceGeometry.Dispose
source: html/39ac06f7-f595-ff9a-314d-c578b0208a9f.htm
---
# Autodesk.Revit.DB.BRepBuilderSurfaceGeometry.Dispose Method

Releases all resources used by the BRepBuilderSurfaceGeometry

## Syntax (C#)
```csharp
public void Dispose()
```